In [7]:
# import libraries
import pandas as pd
import seaborn as sns 
df = sns.load_dataset("titanic")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [8]:
df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [9]:
df1 = df.dropna()

In [10]:
df1.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    0
alive          0
alone          0
dtype: int64

In [11]:
df1.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True

In [12]:
# convert sex into dummy values
df1["sex"] = df1["sex"].replace("male", 1)
df1["sex"] = df1["sex"].replace("female", 0)
df1.head()

C:\Users\Sheharyar\AppData\Local\Temp\ipykernel_15116\1578281934.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1["sex"] = df1["sex"].replace("male", 1)
C:\Users\Sheharyar\AppData\Local\Temp\ipykernel_15116\1578281934.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1["sex"] = df1["sex"].replace("female", 0)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,0,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,0,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,1,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,0,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,0,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True

In [13]:
# selection of input and output data
X = df1[["age", "sex"]]
y = df1["embark_town"]

In [14]:
X.head()

     age  sex
1   38.0    0
3   35.0    0
6   54.0    1
10   4.0    0
11  58.0    0

In [15]:
y.head()

1       Cherbourg
3     Southampton
6     Southampton
10    Southampton
11    Southampton
Name: embark_town, dtype: object

In [16]:
# machine learning algorithm
from sklearn.tree import DecisionTreeClassifier

# Create and fit our model
model = DecisionTreeClassifier().fit(X, y)
# prediction
model.predict([[38, 0]])

c:\Users\Sheharyar\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\base.py:420: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  warnings.warn(

array(['Cherbourg'], dtype=object)

In [17]:
# How to measure the accuracy of our model
# Split the data into 80/20
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score
# 80% train and 20% test data
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.2)

# fitting a model
model.fit(X_train, y_train)
Predicted_values = model.predict(X_test)

Predicted_values

array(['Cherbourg', 'Southampton', 'Cherbourg', 'Southampton',
       'Cherbourg', 'Queenstown', 'Cherbourg', 'Cherbourg', 'Cherbourg',
       'Southampton', 'Cherbourg', 'Southampton', 'Cherbourg',
       'Southampton', 'Southampton', 'Southampton', 'Southampton',
       'Cherbourg', 'Cherbourg', 'Southampton', 'Southampton',
       'Southampton', 'Southampton', 'Cherbourg', 'Southampton',
       'Southampton', 'Cherbourg', 'Southampton', 'Southampton',
       'Cherbourg', 'Cherbourg', 'Cherbourg', 'Cherbourg', 'Southampton',
       'Southampton', 'Cherbourg', 'Cherbourg'], dtype=object)

In [18]:
# checking score
score = accuracy_score(y_test, Predicted_values)
score

0.5405405405405406

In [19]:
# pip install joblib

Requirement already satisfied: joblib in c:\users\sheharyar\appdata\local\programs\python\python311\lib\site-packages (1.2.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip available: 22.3.1 -> 23.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [20]:
# How to train and save your model
import pandas as pd
from sklearn.tree import DecisionTreeClassifier
import joblib
model = DecisionTreeClassifier().fit(X, y)
joblib.dump(model, "destiny.joblib")

['destiny.joblib']

In [ ]:
# how to import and run a stored or saved model on our data?

In [21]:
# graph 
from sklearn import tree
model = DecisionTreeClassifier().fit(X,y)
# graphic evaluation/ look into what happen
tree.export_graphviz(model,
                     out_file="destiny.dot",
                     feature_names=["age", "sex"],
                     class_names=sorted(y.unique()),
                     label=all,
                     rounded=True,
                     filled=True)